Revit 2026 API

# FabricationConfigurationGetItemFolders Method

---

Gets a list of fabrication item folders in the fabrication item folder structure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<FabricationItemFolder> GetItemFolders()
```
```vb
Public Function GetItemFolders As IList(Of FabricationItemFolder)
```
```cpp
public:
IList<FabricationItemFolder^>^ GetItemFolders()
```
```fsharp
member GetItemFolders : unit -> IList<FabricationItemFolder>
```

#### Return Value

IListFabricationItemFolder Returns a list of fabrication item folders in the fabrication item folder structure.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The current fabrication configuration is not connected and updated to source configuration. Reload and try again. |

To get the item folders, you may need to call ReloadConfiguration first.

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace